app/views/pins/_form.html.erb

		<label for="pin_category_id">Category</label>
		<%= f.collection_select(:category_id, Category.all, :id, :name, {}, {:class=>'form-control'}) %>
---
SELECT "categories".* FROM "categories"