app/controllers/pins_controller.rb

SELECT  "pins".* FROM "pins" WHERE "pins"."user_id" = $1 LIMIT 1  [["user_id", 2]]
---
  def index
    @pins = current_user.pins.all

SELECT  "pins".* FROM "pins" WHERE "pins"."slug" = $1 LIMIT 1  [["slug", "rails-for-zombies"]]
---
  def show_by_name
  	@pin = Pin.find_by_slug(params[:slug])

SELECT  "pins".* FROM "pins" WHERE "pins"."id" = $1 LIMIT 1  [["id", 3]]
---
  def show
    @pin = Pin.find(params[:id])

INSERT INTO "pins" ("title", "url", "slug", "text") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Rails Wizard"], ["url", "http://railswizard.org"], ["slug", "rails-wizard"], ["text", "A fun and helpful Rails Resource"]]
---
  def create
    @pin = Pin.create(pin_params)

SELECT  "pins".* FROM "pins" WHERE "pins"."id" = $1 LIMIT 1  [["id", 1]]
---
  def edit
    if current_user
      @pin = Pin.find(params[:id])

SELECT  "pins".* FROM "pins" WHERE "pins"."id" = $1 LIMIT 1  [["id", 6]]
UPDATE "pins" SET "title" = $1, "url" = $2, "slug" = $3, "text" = $4 WHERE "pins"."id" = $5  [["title", "Rails Wizard"], ["url", "http://railswizard.org"], ["slug", "rails-wizard"], ["text", "A fun and helpful Rails Resource"], ["id", 6]]
---
  def update
    @pin = Pin.find(params[:id])

    if @pin.update_attributes(pin_params)